artillery/script-nextjs.yaml
config:
  target: "http://localhost:3005"
  phases:
    - duration: 30s
      arrivalRate: 1
      rampTo: 100
      name: ramp up
    - duration: 20s
      arrivalRate: 100
      name: sustain

scenarios:
  - flow:
      - loop:
        - get:
            url: "/api/users-agg"
        - get:
            url: "/api/users-ind"
        count: 5