artillery/script.yaml
config:
  target: "http://localhost:3005"
  phases:
    - duration: 30s
      arrivalRate: 1
      rampTo: 100
      name: ramp up
    - duration: 20s
      arrivalRate: 100
      name: sustain

scenarios:
  - flow:
      - loop:
        - get:
            url: "/users-agg"
        - get:
            url: "/users-agg-shared"
        - get:
            url: "/users-agg-unique"
        - get:
            url: "/users-ind"
        - get:
            url: "/users-ind-shared"
        - get:
            url: "/users-ind-unique"
        count: 5